app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT "users".* FROM "users"
---
	def index
		@books = Book.all
		@book = Book.new
		@users = User.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
	def show
		@book = Book.find(params[:id])
		@users = User.all

INSERT INTO "books" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 9], ["title", "a"], ["body", "a"], ["created_at", "2020-01-23 12:22:46.914870"], ["updated_at", "2020-01-23 12:22:46.914870"]]
SELECT "books".* FROM "books"
---
	def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
        if @book.save
        flash[:notice] = "successfully"
        redirect_to book_path(@book)
        else
       @books = Book.all