app/controllers/users_controller.rb

	def index
		@books = Book.all
		@book = Book.new
		@users = User.all
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"

	def show
		@book = Book.new
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]